PRAK701/app/Controllers/Book.php

    public function index()
    {
        $data['book'] = $this->bookModel->findAll();
---
SELECT *
FROM `book`

            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ];

        $this->bookModel->insert($data);
---
INSERT INTO `book` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Laut Bercerita', 'Leila S Chudori', 'Kepustakaan Populer Gramedia', '2017')

    public function edit($id)
    {
        $book = $this->bookModel->find($id);
---
SELECT *
FROM `book`
WHERE `book`.`id` = '4'